Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: བདུད་དང་བཅས་པ་དང་། ཚངས་པ་དང་བཅས་པ་དང་། དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པའི་སྐྱེ་དགུ་དང་། ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ན་མ་མཐོང་ངོ་། །
en: Indeed, Śāntamati, I do not see anyone in this world with its gods, māras, and brahmās, or among its beings, including its ascetics and brahmins, and its gods, humans, and asuras, who has the power to grasp the measure and limit of a realized one’s voice.

source: ཞི་བའི་བློ་གྲོས་ཁོ་བོས་མངོན་པར་ཤེས་ཏེ། བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་འདི་ཉིད་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་བཞུགས་ཏེ།
en: Śāntamati, I remember one time when the Blessed One was residing right here in Rājagṛha on the hill Vulture Peak, surrounded by a multitude of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བརྟེན་ནས་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དེ་མཇུག་ཏུ་ཕྱིན་པའི་དུས་ཀྱི་ཚེ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: He was revealing at length a teaching of the Dharma called ‘the purification of the sphere of sound,’ and after he had empowered the bodhisattva of great courage, Maitreya, he was nearing the end of the discourse.

source: དེ་བཞིན་གཤེགས་པའི་གསུང་གི་དཀྱིལ་འཁོར་ཇི་སྲིད་ཅིག་ཏུ་རིང་དུ་འགྲོ་བ་ཞིག་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་དཀྱིལ་འཁོར་དཔག་པར་བྱའོ་སྙམ་མོ། །
en: At that moment, Venerable Maudgalyāyana the Great thought to himself, ‘How far does the Realized One’s sphere of sound go?

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རང་གི་སྟན་གྱི་སྟེང་ནས་མི་སྣང་བར་གྱུར་ཏེ། རི་རབ་ཀྱི་རྩེ་མོར་ཕྱིན་ནས་དེ་དེ་ན་འདུག་ན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་དེ་འདྲ་བ་ཁོ་ནར་ཐོས་སོ། །
en: I would like to measure the Realized One’s sphere of sound.’ So, the elder, Maudgalyāyana the Great, vanished from his seat and reappeared on the summit of Mount Meru, but while he was standing there he still heard the speech of the Realized One just as clearly as before.

source: རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིའི་ནུབ་ཕྱོགས་ཀྱི་རི་རབ་ལས་འདས་ཤིང་གླིང་བཞི་པ་ལས་ཀྱང་འདས་ཁོར་ཡུག་ལས་ཀྱང་འདས་ཏེ།
en: So, with the strength of his own superhuman powers, he went to the west of this cosmos of a billion worlds, beyond Mount Meru, beyond the four continents, beyond the mountain ranges and great mountain ranges, until he stood on the peak of the mountain range at the end of the world.

source: འཇིག་རྟེན་གྱི་བར་གྱི་ཁོར་ཡུག་གི་ཟོམ་ལ་འདུག་ན་ཡང་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་ལྷག་ཆད་མེད་ཅིང་མཉམ་པར་དེ་འདྲ་བ་ཁོ་ནར་ཐོས་སོ། །
en: However, even there he could hear the Blessed One’s speech just as clearly as before. It was the same, nothing more or less.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྙམ་དུ་དགོངས་ཏེ།
en: “At this point, the Blessed One had the thought, ‘Oh!

source: ཀྱེ་མ་མཽད་གལ་གྱི་བུ་འདི་ངའི་སྒྲ་སྐད་དཔོག་པར་འདོད་ཀྱིས་ངས་འདི་ལ་རྫུ་འཕྲུལ་གྱིས་བསྟང་ངོ་སྙམ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་རྫུ་འཕྲུལ་གྱིས་བསྟངས་པ་དང་།
en: Maudgalyāyana wishes to measure the sound of my voice.

source: དེ་སངས་རྒྱས་ཀྱི་མཐུ་དང་། རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བ་དེ་ན་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་ད་ལྟ་ན་བཞུགས་ཤིང་འཚོལ་གཞེས་ཏེ་ཆོས་ཀྱང་སྟོན་པ་དེར་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་ཕྱིན་ཏེ།
en: In that case, I should withdraw my superhuman powers.’ Then, once the Blessed One had withdrawn his superhuman powers, the elder, Maudgalyāyana the Great, through the majestic power of the Buddha and the strength of his own superhuman powers, traveled farther westward from this world, beyond buddha domains as numerous as the grains of sand in ninety-nine Ganges Rivers, before finally arriving at a world called Raśmidhvajā, where the realized one Raśmirāja stays, abides, and presently lives teaching the Dharma.

source: དེ་ན་འདུག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་སྒྲ་སྐད་དེ་འདྲ་བ་ཁོ་ནར་ཐོས་ཏེ།
en: Standing there even in that distant world, the elder, Maudgalyāyana the Great, could still hear the speech of the Blessed One just as clearly as before.

source: འདི་ལྟ་སྟེ་དཔེར་ན་འདོམ་གང་ཙམ་གྱི་ཕྱོགས་ན་འདུག་པའི་མིས་མི་ཅིག་ཤོས་ཀྱི་སྒྲ་ཐོས་པ་དེ་བཞིན་དུ་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་གནས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་གསུང་སྒྲ་ཐོས་སོ། །
en: Just as clearly as one can hear the voice of someone who is only a meter away, that is how clearly the elder, Maudgalyāyana the Great, could hear the speech of the Blessed One.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེའི་སྐུའི་ཁྲུན་ནི་དཔག་ཚད་ཙམ་མོ། །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ལུས་ཀྱི་ཁྲུན་ནི་དཔག་ཚད་ཕྱེད་དོ། །
en: “Now, the body of the realized one, the blessed Raśmirāja, is a league in height, and the bodies of the bodhisattvas in that realm are half a league in height.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་སྤྱད་པར་བྱ་བའི་ལྷུང་བཟེད་ཀྱི་རྟེན་མ་གདུ་བུ་དེ་ལ་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འཆག་ཅིང་འདུག་གོ །
en: So, there was the elder, Maudgalyāyana the Great, walking along the rims of the alms bowls of those bodhisattvas.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་རབ་ཏུ་དགའ་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattvas were quite pleased, and they asked the Blessed One, ‘Blessed One, who is this tiny creature who seems to have the appearance of a monk and is walking along the rims of our alms bowls?

source: བཅོམ་ལྡན་འདས་དགེ་སྦྱོང་གི་ཁ་དོག་འདྲ་བའི་སྲོག་ཆགས་ལྷུང་བཟེད་ཀྱི་རྟེན་མའི་གདུ་བུ་ལ་འཆག་ཅིང་མཆིས་པ་འདི་ག་ལས་མཆིས་པ་ཞིག་བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ།
en: From where has he come?’

source: རིགས་ཀྱི་བུ་ཁྱེད་འདི་ལ་བརྙས་པའི་སེམས་མ་སྐྱེད་ཅིག །
en: “The Blessed One answered, ‘Noble sons, do not conceive any thoughts that make fun of him.

source: འདི་ནི་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཞེས་བྱ་སྟེ།
en: He is the elder, Maudgalyāyana the Great.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཉན་ཐོས་ཀྱི་མཆོག་གོ །
en: He is among the blessed Śākyamuni’s foremost disciples.

source: ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་ནང་ན་རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་གོ །དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མཽད་གལ་གྱི་བུ་ཁྱོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཁྱད་དུ་གསོད་ཀྱིས། ཁྱོད་ཀྱིས་འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་དེ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་རང་གི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་སྟོན་ཅིག །
en: Among his great disciples, he is the foremost in the possession of superhuman powers.’ Then, the realized one, the blessed Raśmirāja said to the elder, Maudgalyāyana the Great, ‘Maudgalyāyana, since these bodhisattvas have looked down upon you, you should display miracles with your superhuman powers, having been empowered by the empowering authority of the blessed one, the realized one, the worthy one, the perfect Buddha Śākyamuni.’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་བདུན་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིན་པོ་ཆེའི་གླིང་འདི་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །
en: “At that point, the elder, Maudgalyāyana the Great, bowed at the feet of that Blessed One, walked around him seven times, keeping him on the right, and addressed him, saying, ‘Blessed One, I will pervade this whole jeweled continent while seated in a cross-legged posture.’

source: བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་གྱིས་ཤིག །
en: “That Blessed One replied, ‘Maudgalyāyana, when you know the time is right, go ahead!’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སྟེང་གི་ནམ་མཁའ་ལ་ཤིང་ཏ་ལ་བདུན་ཙམ་གྱི་གོང་དུ་མངོན་པར་འཕགས་ཏེ། རིན་པོ་ཆེའི་གླིང་དེ་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཁྱབ་པར་བྱས་སོ། །
en: “Then, the elder, Maudgalyāyana the Great, rose into the air to the height of seven palm trees and pervaded the entire jeweled continent while seated in a single cross-legged posture.

source: སྐྱིལ་མོ་ཀྲུང་དེ་ལས་ཀྱང་མུ་ཏིག་གི་རྒྱན་ཕྲེང་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མངོན་པར་འཕྱང་ངོ་། །
en: From his cross-legged posture hung hundreds of thousands of millions and billions of strings of pearls.

source: མུ་ཏིག་གི་རྒྱན་ཕྲེང་གི་འབྲུ་ཐམས་ཅད་ལས་ཀྱང་འོད་ཟེར་བརྒྱ་སྟོང་བྱུང་ངོ་། །འོད་ཟེར་དེ་དག་ཐམས་ཅད་ཀྱི་རྩེ་མོ་དག་ལས་ཀྱང་པད་མ་རྣམས་བྱུང་ངོ་། །པད་མ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་རྣམས་ལ་ཡང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་ཅི་འདྲ་བ་དེ་འདྲ་བའི་དེ་བཞིན་གཤེགས་པའི་གཟུགས་བཞུགས་པར་སྣང་ངོ་། །
en: Each of the pearls emitted a hundred thousand rays of light, and from the points of each of these rays of light, lotuses arose, and within the center of each lotus appeared a seated figure that was an exact likeness of the blessed one Śākyamuni.

source: དེ་བཞིན་གཤེགས་པའི་གཟུགས་དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལས་བརྩམས་ཏེ་བསྔགས་པ་གསུང་ངོ་། །
en: All of these figures of the Realized One then spoke in praise of the teaching of the Dharma of the blessed one Śākyamuni called ‘the purification of the sphere of sound.’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: “The elder, Maudgalyāyana the Great, then said to that Blessed One, ‘Blessed One, I have now pervaded this world of four continents with a single seated posture.

source: དེ་ལྟར་སྟོང་དང་སྟོང་གཉིས་པ་ཁྱབ་པར་བགྱིའོ། །
en: I will likewise pervade a galaxy of a thousand worlds and a galaxy of a hundred thousand worlds.

source: བཅོམ་ལྡན་འདས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་ཁྱབ་པར་བགྱིའོ། །
en: Blessed One, I will even pervade this whole great cosmos of a billion worlds with a single seated posture.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་དེའི་དུས་ལ་བབ་པར་ཤེས་ན་གྱིས་ཤིག །
en: “That Blessed One said, ‘Maudgalyāyana, when you know the time is right, go ahead!’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་རྫུ་འཕྲུལ་དེ་བསྡུས་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་གོ །
en: “The elder, Maudgalyāyana the Great, then withdrew his miraculous demonstration and took a seat before the Blessed One.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ངོ་མཚར་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འདི་ཅི་ཞིག་གི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་འདིར་མཆིས།
en: The bodhisattvas were awestruck and asked that Blessed One, ‘Blessed One, for what purpose has the elder, Maudgalyāyana the Great, come to this world?’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་བ། རིགས་ཀྱི་བུ་དག་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེའི་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་ཤེས་པར་འདོད་ནས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་སོ། །
en: “The Blessed One answered, ‘Noble sons, he has come to this world with the desire to know the measure of the blessed Śākyamuni’s sphere of sound.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །མཽད་གལ་གྱི་བུ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་གསུང་དབྱངས་ཚད་མེད་པའི་གསུང་གི་དཀྱིལ་འཁོར་ཤེས་པར་འདོད་པས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་གྱི།
en: “The Blessed One then spoke to the elder, Maudgalyāyana the Great, saying, ‘Maudgalyāyana, you have come to this world with the desire to know the measure of the sphere of sound of the blessed Śākyamuni’s immeasurable voice.

source: ཁྱོད་ཀྱིས་ལན་གཉིས་སུ་དེ་ལྟ་བུའི་སེམས་མ་སྐྱེད་ཅིག །
en: However, you should not give this a second thought.

source: གལ་ཏེ་མཽད་གལ་གྱི་བུ་ཁྱོད་ཤུགས་འདི་ཉིད་དང་། རྫུ་འཕྲུལ་གྱི་སྟོབས་འདི་ཉིད་ཀྱིས་ནུབ་ཕྱོགས་ལོགས་སུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་བསྐལ་པར་སོང་ཡང་ཁྱོད་ཀྱིས་འདི་ལྟར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེའི་གསུང་གི་དཀྱིལ་འཁོར་གྱི་མཐའ་རྟོགས་པར་མི་ནུས་ཏེ།
en: Maudgalyāyana, even if you were to use the strength of your own superhuman powers to travel farther west for eons as numerous as there are grains of sand in the Ganges River, you would not be able to reach the limit to the sphere of sound of the blessed Śākyamuni.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་དེ་ལྟར་གསུང་དབྱངས་ཚད་མེད་པ་དང་ལྡན་ནོ། །
en: Blessed buddhas possess an immeasurable voice.’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་དེའི་ཞབས་གཉིས་ལ་ཕྱག་འཚལ་ཏེ། ཉེས་པ་བཤགས་པ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཚད་མ་མཆིས་པའི་གསུང་གི་དཀྱིལ་འཁོར་རྟོགས་པར་འཚལ་བས་བདག་ནི་ནོངས་པ་ཅན་ཏེ་ནོངས་པ་འཆགས་སོ། །
en: “So, the elder, Maudgalyāyana the Great, bowed at the feet of that Blessed One and admitted his mistake: ‘Blessed One, in trying to understand the sphere of sound of the endless voice of the Realized One, I have made a mistake, and I admit this mistake.

source: བཅོམ་ལྡན་འདས་བདག་ཇི་སྲིད་ཅིག་གནས་མཆིས།
en: Blessed One, how far have I come?’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་པ་ནས་ཁྱོད་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོངས་སོ། །
en: “The Blessed One answered, ‘You have come to this world after passing through worlds equal in number to the grains of sand in ninety-nine Ganges Rivers.’

source: མཽད་གལ་གྱི་བུས་གསོལ་བ། བཅོམ་ལྡན་འདས་བདག་ནི་རིང་མོ་ཞིག་ནས་མཆིས་པས་ལུས་དུབ་སྟེ།
en: “Maudgalyāyana said, ‘Blessed One, I am exhausted after having traveled so far.

source: འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་མཆི་བའི་རྔོ་མི་ཐོག་གོ །
en: I am unable to return to the Sahā world.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “ ‘Maudgalyāyana, what do you think?’ asked the Blessed One.

source: ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་སྙམ་དུ་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: ‘Do you think that you have come to this world through the strength of your own superhuman powers? You should not think so.

source: ཁྱོད་ནི་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་ཉིད་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་གྱིས།
en: You came to this world through the majestic power and empowering authority of the blessed Śākyamuni.

source: ཁྱོད་བཅོམ་ལྡན་འདས་དེ་ཉིད་ལ་ཕྱག་འཚོལ་ཅིག་དང་། དེ་ཉིད་ཀྱིས་ཁྱོད་སླར་ཁྲིད་པར་འགྱུར་རོ། །
en: Pay homage to that Blessed One, and he will bring you back home.

source: མཽད་གལ་གྱི་བུ་གལ་ཏེ་ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེར་འགྲོ་ན་ནི་བསྐལ་པ་སྲིད་ཀྱིས་ཀྱང་ཕྱིན་པར་མི་ནུས་ཏེ།
en: Maudgalyāyana, even if you were to go to that world on the strength of your own superhuman powers, you would not be able to get there even within the span of an eon.

source: འཇིག་རྟེན་གྱི་ཁམས་དེར་མ་ཕྱིན་པར་བར་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། །
en: You would enter into complete cessation before you arrived there.

source: མཽད་གལ་གྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། ཤར་རམ།
en: What do you think, Maudgalyāyana?

source: ལྷོ་འམ། ནུབ་བམ། བྱང་ངམ། ཕྱོགས་གང་ཞིག་ཏུ་ཕྱིན། གསོལ་པ།
en: From which direction have you traveled here: north, south, east, or west?’

source: བཅོམ་ལྡན་འདས་བདག་ཕྱོགས་བསླད་དེ་གང་ནས་འདིར་མཆིས་པ་མ་འཚལ་ཏོ། །
en: “ ‘Blessed One, I am disoriented,’ Maudgalyāyana answered. ‘I don’t know the direction from which I came to here.’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། གལ་ཏེ་ཁྱོད་རང་གི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེར་འགྲོ་ན་ནི་བསྐལ་པས་ཀྱང་ཕྱིན་པར་མི་ནུས་སོ། །
en: “The Blessed One said, ‘Maudgalyāyana, the main point you should understand is that if you were to go toward that world on the strength of your own superhuman powers, you would not be able to get there even within an eon.’

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཕྱོགས་གང་ན་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པ་དེ་བཞུགས། བཀའ་སྩལ་པ།
en: “Maudgalyāyana asked, ‘Blessed One, in which direction is the blessed Śākyamuni dwelling?’

source: མཽད་གལ་གྱི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དེ་ནི་ཤར་ཕྱོགས་ལོགས་ན་བཞུགས་སོ། །
en: “ ‘Maudgalyāyana,’ answered the Blessed One, ‘the realized one, the blessed Śākyamuni, is dwelling in the east.’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་དེའི་ཚེ་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ། ཤར་ཕྱོགས་སུ་ཕྱག་འཚལ་ནས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: “So, at that moment the elder, Maudgalyāyana the Great, bowed down to the east, placing his knees, elbows, palms and forehead on the ground, and spoke in verse:

source: མཐུ་ཆེན་མངའ་བ་ལྷ་དང་མིས་མཆོད་པ། །
en: “ ‘You, of great superhuman power, worshiped by gods and men,

source: ཡེ་ཤེས་མཐའ་ཡས་མཐའ་ཡས་གསུང་ལྡན་པ། །
en: Of infinite wisdom, and possessing infinite speech,

source: རྐང་གཉིས་རྣམས་ཀྱི་དམ་པ་དགོངས་སུ་གསོལ། །
en: O best of bipeds, please hear me:

source: སླར་ཡང་ཞིང་དེར་རབ་ཏུ་མཆི་བར་བགྱི། །
en: May I return once again to that domain!’

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས། བཅོམ་ལྡན་འདས་ཀྱི་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གནས་པ་དེས་གནས་བརྟན་མཽད་གལ་གྱི་བུས་གསོལ་བ་བཏབ་པའི་སྒྲ་དེ་ཐོས་སོ། །
en: “Śāntamati, through the majestic power of the Buddha the entire assembly gathered on Vulture Peak was able to hear Maudgalyāyana’s entreaty.

source: ཐོས་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་གསོལ་བ་འདེབས་པ་འདི་སུ་ཞིག་ལགས།
en: Once they all heard it, Venerable Ānanda asked the Blessed One, ‘Blessed One, who is making this entreaty?’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་འདི་ནི་མཽད་གལ་གྱི་བུ་སྟེ།
en: “The Blessed One answered, ‘Ānanda, it is Maudgalyāyana.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་ནུབ་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་འདས་པར་སོང་སྟེ།
en: He left this buddha domain and traveled west, traveling through buddha domains as numerous as there are grains of sand in ninety-nine Ganges Rivers.

source: འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་ཞེས་བྱ་བར་བཅོམ་ལྡན་འདས་འོད་ཟེར་གྱི་རྒྱལ་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་གནས་ཏེ་དེ་འཇིག་རྟེན་གྱི་ཁམས་འདིར་འོང་བར་འདོད་ནས་གསོལ་བ་འདེབས་པའི་སྒྲ་དེ་ལྟ་བུ་ཕྱུང་ངོ་། །
en: He is in a world called Raśmidhvajā, in the buddha domain of the blessed one Raśmirāja. Yet, now he wishes to return to this world, and so he is making this entreaty.’

source: ཀུན་དགའ་བོས་གསོལ་པ། བཅོམ་ལྡན་འདས་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཅིའི་སླད་དུ་འཇིག་རྟེན་གྱི་ཁམས་དེར་མཆིས།
en: “Ānanda asked, ‘Blessed One, for what purpose did Maudgalyāyana the Great go to that world?’

source: བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་མཽད་གལ་གྱི་བུ་འདིར་སླར་འོངས་པ་དང་འདི་ཉིད་དུ་ཐོས་པར་འགྱུར་རོ། །
en: “The Blessed One answered, ‘Ānanda, Maudgalyāyana will come back here, and then you will hear of it.’

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་བལྟ་བར་འཚལ་ལོ། །
en: “Then everyone in the entire assembly knelt down on one knee and raised their arms, palms together in a gesture of salutation, and entreated the Blessed One, saying, ‘Blessed One, we also wish to see the world Raśmidhvajā, the realized one Raśmirāja, the bodhisattvas there, as well as the elder, Maudgalyāyana the Great!’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་དེས་གསོལ་བ་བཏབ་པ་མཁྱེན་ནས་མཛོད་སྤུ་ནས་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་འོད་ཟེར་ཕྱུང་སྟེ་འོད་ཟེར་དེས་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་དགུ་བཅུ་རྩ་དགུའི་བྱེ་མ་སྙེད་པོ་དེ་དག་ལས་ཐལ་ཏེ་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ། །
en: “Cognizant of the entreaty of his assembly, the Blessed One then emitted a ray of light called the ray of light that goes everywhere from the tuft of hair between his eyebrows. This ray of light passed through buddha domains as numerous as there are grains of sand in ninety-nine Ganges Rivers and bathed the world Raśmidhvajā in a bright light.

source: དེ་ན་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེས་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱི་རྒྱལ་མཚན་དེ་དང་། དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་གྱི་རྒྱལ་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་གསོལ་བ་འདེབས་པ་མཐོང་ངོ་། །
en: The entire retinue then beheld the Raśmidhvajā world, the realized one Raśmirāja, the bodhisattvas there, and the elder, Maudgalyāyana the Great, who was on the ground entreating the Blessed One.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་འོད་ཀྱི་དཀྱིལ་འཁོར་འདིའི་རྗེས་སུ་འབྲངས་ཏེ་ཤོག་ཤིག །
en: “Then the Blessed One instructed Venerable Maudgalyāyana the Great, ‘Maudgalyāyana, follow this beam of light!’

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བཅོམ་ལྡན་འདས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་ལ་བརྟེན་ཏེ། སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཙམ་གྱིས་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་འདིར་བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་སྤྱན་སྔར་ཕྱིན་ནས་དེས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: “At that point, the elder, Maudgalyāyana the Great, relying on the Blessed One’s beam of light, reappeared in the presence of the blessed Śākyamuni in this Sahā world in as little time as it takes to think a thought.

source: ལན་བདུན་བསྐོར་བ་བྱས་ནས་སྤྱན་སྔར་ཡན་ལག་ལྔ་ས་ལ་གཏུགས་ཏེ་ཕྱག་འཚལ་ནས་ཉེས་པ་བཤགས་པ།
en: He bowed his head at the feet of the Blessed One and walked around him seven times, keeping him on the right.

source: བཅོམ་ལྡན་འདས་བདག་དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཚད་མ་མཆིས་པའི་གསུང་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྟོགས་པར་འཚལ་ནས་དེ་སྲིད་དུ་རིང་དུ་མཆིས་པས་བདག་ནོངས་པ་ཅན་ཏེ་ནོངས་པ་འཆགས་སོ། །
en: He then bowed down before the Blessed One, placing his knees, elbows, palms and forehead on the ground, and admitted his mistake, saying, ‘Blessed One, I went so far in the hope of comprehending the sphere of sound of the immeasurable voice of the Realized One. I have made an error, and I admit this mistake.

source: བཅོམ་ལྡན་འདས་དེ་སྲིད་དུ་རིང་དུ་མཆིས་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་འདི་ན་ཇི་ཙམ་པ་དེ་ཙམ་ལགས་སོ། །
en: Blessed One, no matter how far I went, the Realized One’s speech sounded exactly the same as it does here.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཆེན་པོ་ཇི་སྐད་སྨྲས་པ་དེ་དེ་བཞིན་ནོ། །
en: “ ‘Maudgalyāyana the Great, it is exactly as you have said,’ replied the Blessed One.

source: དེ་བཞིན་གཤེགས་པའི་གསུང་ལ་ནི་ཚད་གང་ཡང་མེད་དེ།
en: ‘The speech of the realized ones cannot be measured.

source: མཽད་གལ་གྱི་བུ་གང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་ཚད་དམ་མཐའ་ཡོངས་སུ་ཚོལ་བར་སེམས་པ་དེ་ནི་ནམ་མཁའི་ཚད་དམ། མཐའ་ཡོངས་སུ་ཚོལ་བར་སེམས་པ་ཡིན་ནོ། །
en: Maudgalyāyana, those who have the intention to examine thoroughly the measure or limit of the speech of the Realized One must have the intention to examine thoroughly the measure or limit of space.

source: ནམ་མཁའ་ཇི་ཙམ་དུ་ཁྱབ་པ་དེ་ཙམ་དུ་དེ་བཞིན་གཤེགས་པའི་གསུང་གིས་ཁྱབ་བོ། །
en: The speech of the Realized One pervades just as far as space pervades.’

source: གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོ་འགྲོ་བ་དང་། འོང་བའི་ལེའུ་འདི་བཤད་པ་ན་སྲོག་ཆགས་ཁྲིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “When they heard the explanation of the travels of the elder, Maudgalyāyana the Great, ten thousand beings conceived the aspiration for unsurpassable and perfect awakening.

source: ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བའོ། །ཞི་བའི་བློ་གྲོས་འདི་ཇི་སྙམ་དུ་སེམས།
en: This, too, Śāntamati, is the secret of the speech of a realized one.”

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་གང་དག་ཡིན་པ་དེ་དག་ཅི་མང་བ་ཡིན་ནམ།
en: Vajrapāṇi then said, “Tell me, Śāntamati, would you describe the thoughts of all beings and the actions that arise from those thoughts as amounting to a large number?”

source: ཞི་བའི་བློ་གྲོས་ཀྱིས་སྨྲས་པ། གསང་བ་པའི་བདག་པོ་སེམས་ཅན་གཅིག་གི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་གང་དག་ཡིན་པ་དེ་དག་ཀྱང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོར་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་རང་སངས་རྒྱས་སུ་གྱུར་པ་རྣམས་ཀྱིས་བསྐལ་པར་ཡང་བསམ་པའམ། གཞལ་བ་འམ། བརྩི་བའམ། བརྟག་པར་མི་ནུས་ན།
en: “Lord of the Guhyakas,” responded Śāntamati, “even if all beings in this cosmos of a billion worlds were to become solitary buddhas, they would still not be able to conceive, measure, count, or examine all the thoughts of even a single being and the actions that arise from those thoughts, even if they had an eon to do so.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: So, there is no need to talk of all beings.”

source: ལག་ན་རྡོ་རྗེས་སྨྲས་པ། ཞི་བའི་བློ་གྲོས་ཁྱོད་མོས་པར་བྱའོ། །
en: “Śāntamati, this is what you should aspire to do!” said Vajrapāṇi.

source: ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “This is what you should strive to realize!
